src/cf/Catalogs/НастройкиПодключенияКСистемеБыстрыхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияКСистемеБыстрыхПлатежей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторМерчанта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>140</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУчастника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНастройки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНастройкиСБП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПлатежнаяСистема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьПлатежныеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаПеренаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/НастройкиПодключенияКСистемеБыстрыхПлатежей/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ТекстОшибки = "";
	Если Не ЭтоГруппа Тогда
		Если Не ЗначениеЗаполнено(ИдентификаторМерчанта) Тогда
			ТекстОшибки = ТекстОшибки
				+ НСтр("ru = 'Поле ИдентификаторМерчанта не заполнено.'")
				+ Символы.ПС;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ИдентификаторУчастника) Тогда
			ТекстОшибки = ТекстОшибки
				+ НСтр("ru = 'Поле ИдентификаторУчастника не заполнено.'")
				+ Символы.ПС;
			КонецЕсли;
		Если Не ЗначениеЗаполнено(Родитель) Тогда
			ТекстОшибки = ТекстОшибки
				+ НСтр("ru = 'Поле Родитель не заполнено.'")
				+ Символы.ПС;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВариантНастройки) Тогда
			ТекстОшибки = ТекстОшибки
				+ НСтр("ru = 'Поле ВариантНастройки не заполнено.'")
				+ Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			Отказ = Истина;
			СистемаБыстрыхПлатежейСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось записать: Настройка подключения к Системе быстрых платежей
						|%1'"),
					ТекстОшибки));
		КонецЕсли;
	КонецЕсли;
	
	// При добавлении первой настройки подключения с Системой быстрых платежей должно быть
	// создано регламентное задание по загрузке идентификаторов платежных.
	УстановитьПривилегированныйРежим(Истина);
	НастройкиПлатежныхСистемСлужебный.ДобавитьЗаданиеЗагрузкаСтатусовОпераций();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
